Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-faq.Rmd-*.po
Languages: es

source: This is _lexical scoping_ as explained in [R FAQ 3.3.1]{1}. The environment in which the function was created is not relevant, though, because there is _no function_. No anonymous _function_ is passed to `j`. Instead, an anonymous _body_ is passed to `j`; for example,
es: Este es el _alcance léxico_ como se explica en [R FAQ 3.3.1]{1}. Sin embargo, el entorno en el que se creó la función no es relevante, porque _no hay función_. No se pasa ninguna _función_ anónima a `j`. En cambio, se pasa un _cuerpo_ anónimo a `j`; por ejemplo,

source: Some programming languages call this a _lambda_.
es: Algunos lenguajes de programación llaman a esto _lambda_.

source: Can I trace the `j` expression as it runs through the groups? {#j-trace}
es: ¿Puedo rastrear la expresión 'j' a medida que se ejecuta a través de los grupos? {#j-trace}

source: Try something like this:
es: Prueba algo como esto:

source: Inside each group, why are the group variables length-1?
es: Dentro de cada grupo, ¿por qué las variables del grupo tienen una longitud de 1?

source: [Above]{1}, `x` is a grouping variable and (as from v1.6.1) has `length` 1 (if inspected or used in `j`). It's for efficiency and convenience. Therefore, there is no difference between the following two statements:
es: [Arriba]{1}, `x` es una variable de agrupamiento y (a partir de la versión v1.6.1) tiene una `longitud` de 1 (si se inspecciona o se utiliza en `j`). Esto es por eficiencia y conveniencia. Por lo tanto, no hay diferencia entre las dos afirmaciones siguientes:

source: If you need the size of the current group, use `.N` rather than calling `length()` on any column.
es: Si necesita el tamaño del grupo actual, utilice `.N` en lugar de llamar a `length()` en cualquier columna.

source: Only the first 10 rows are printed, how do I print more?
es: Solo se imprimen las primeras 10 filas, ¿cómo imprimo más?

source: There are two things happening here. First, if the number of rows in a data.table are large (`> 100` by default), then a summary of the data.table is printed to the console by default. Second, the summary of a large data.table is printed by taking the top and bottom `n` (`= 5` by default) rows of the data.table and only printing those. Both of these parameters (when to trigger a summary and how much of a table to use as a summary) are configurable by R's `options` mechanism, or by calling the `print` function directly.
es: Aquí suceden dos cosas. En primer lugar, si la cantidad de filas en una tabla de datos es grande (`> 100` por defecto), entonces se imprime un resumen de la tabla de datos en la consola por defecto. En segundo lugar, el resumen de una tabla de datos grande se imprime tomando las `n` filas superiores e inferiores (`= 5` por defecto) de la tabla de datos y solo imprimiendo esas. Ambos parámetros (cuándo activar un resumen y qué parte de una tabla utilizar como resumen) se pueden configurar mediante el mecanismo `options` de R o llamando directamente a la función `print`.

source: For instance, to enforce the summary of a data.table to only happen when a data.table is greater than 50 rows, you could `options(datatable.print.nrows = 50)`. To disable the summary-by-default completely, you could `options(datatable.print.nrows = Inf)`. You could also call `print` directly, as in `print(your.data.table, nrows = Inf)`.
es: Por ejemplo, para hacer que el resumen de una tabla de datos solo se realice cuando una tabla de datos tenga más de 50 filas, puede usar `options(datatable.print.nrows = 50)`. Para deshabilitar por completo el resumen predeterminado, puede usar `options(datatable.print.nrows = Inf)`. También puede llamar a `print` directamente, como en `print(your.data.table, nrows = Inf)`.

source: If you want to show more than just the top (and bottom) 10 rows of a data.table summary (say you like 20), set `options(datatable.print.topn = 20)`, for example. Again, you could also just call `print` directly, as in `print(your.data.table, topn = 20)`.
es: Si desea mostrar más de las 10 filas superiores (e inferiores) de un resumen de data.table (digamos que desea 20), configure `options(datatable.print.topn = 20)`, por ejemplo. Nuevamente, también podría llamar a `print` directamente, como en `print(your.data.table, topn = 20)`.

source: With an `X[Y]` join, what if `X` contains a column called `"Y"`?
es: Con una unión `X[Y]`, ¿qué pasa si `X` contiene una columna llamada `"Y"`?

source: When `i` is a single name such as `Y` it is evaluated in the calling frame. In all other cases such as calls to `.()` or other expressions, `i` is evaluated within the scope of `X`. This facilitates easy _self-joins_ such as `X[J(unique(colA)), mult = "first"]`.
es: Cuando `i` es un nombre único, como `Y`, se evalúa en el marco de llamada. En todos los demás casos, como llamadas a `.()` u otras expresiones, `i` se evalúa dentro del alcance de `X`. Esto facilita las _autouniones_ sencillas, como `X[J(unique(colA)), mult = "first"]`.

source: `X[Z[Y]]` is failing because `X` contains a column `"Y"`. I'd like it to use the table `Y` in calling scope.
es: `X[Z[Y]]` falla porque `X` contiene una columna `"Y"`. Me gustaría que utilizara la tabla `Y` en el ámbito de llamada.

source: The `Z[Y]` part is not a single name so that is evaluated within the frame of `X` and the problem occurs. Try `tmp = Z[Y]; X[tmp]`. This is robust to `X` containing a column `"tmp"` because `tmp` is a single name. If you often encounter conflicts of this type, one simple solution may be to name all tables in uppercase and all column names in lowercase, or some similar scheme.
es: La parte `Z[Y]` no es un nombre único, por lo que se evalúa dentro del marco de `X` y se produce el problema. Pruebe `tmp = Z[Y]; X[tmp]`. Esto es robusto para `X` que contiene una columna `"tmp"` porque `tmp` es un nombre único. Si a menudo encuentra conflictos de este tipo, una solución sencilla puede ser nombrar todas las tablas en mayúsculas y todos los nombres de columnas en minúsculas, o algún esquema similar.

source: Can you explain further why data.table is inspired by `A[B]` syntax in `base`?
es: ¿Puedes explicar con más detalle por qué data.table está inspirado en la sintaxis `A[B]` en `base`?

source: Consider `A[B]` syntax using an example matrix `A`:
es: Considere la sintaxis `A[B]` usando una matriz de ejemplo `A`:

source: To obtain cells `(1, 2) = 5` and `(3, 3) = 11` many users (we believe) may try this first:
es: Para obtener las celdas `(1, 2) = 5` y `(3, 3) = 11` muchos usuarios (creemos) pueden intentar esto primero:

source: However, this returns the union of those rows and columns. To reference the cells, a 2-column matrix is required. `?Extract` says:
es: Sin embargo, esto devuelve la unión de esas filas y columnas. Para hacer referencia a las celdas, se requiere una matriz de 2 columnas. `?Extract` dice:

source: When indexing arrays by `[` a single argument `i` can be a matrix with as many columns as there are dimensions of `x`; the result is then a vector with elements corresponding to the sets of indices in each row of `i`.
es: Al indexar matrices mediante `[`, un único argumento `i` puede ser una matriz con tantas columnas como dimensiones de `x`; el resultado es entonces un vector con elementos correspondientes a los conjuntos de índices en cada fila de `i`.

source: Let's try again.
es: Vamos a intentarlo de nuevo.

source: A matrix is a 2-dimensional structure with row names and column names. Can we do the same with names?
es: Una matriz es una estructura bidimensional con nombres de filas y nombres de columnas. ¿Podemos hacer lo mismo con los nombres?

source: So yes, we can. Can we do the same with a `data.frame`?
es: Entonces sí podemos. ¿Podemos hacer lo mismo con un `data.frame`?

source: But, notice that the result was coerced to `character.` R coerced `A` to `matrix` first so that the syntax could work, but the result isn't ideal. Let's try making `B` a `data.frame`.
es: Pero, observe que el resultado se convirtió a `character`. R convirtió `A` a `matrix` primero para que la sintaxis pudiera funcionar, pero el resultado no es ideal. Intentemos convertir `B` en `data.frame`.

source: So we can't subset a `data.frame` by a `data.frame` in base R. What if we want row names and column names that aren't `character` but `integer` or `float`? What if we want more than 2 dimensions of mixed types? Enter data.table.
es: Por lo tanto, no podemos crear un subconjunto de un `data.frame` con un `data.frame` en R base. ¿Qué sucede si queremos nombres de filas y columnas que no sean `character` sino `integer` o `float`? ¿Qué sucede si queremos más de 2 dimensiones de tipos mixtos? Ingrese data.table.

source: Furthermore, matrices, especially sparse matrices, are often stored in a 3-column tuple: `(i, j, value)`. This can be thought of as a key-value pair where `i` and `j` form a 2-column key. If we have more than one value, perhaps of different types, it might look like `(i, j, val1, val2, val3, ...)`. This looks very much like a `data.frame`. Hence data.table extends `data.frame` so that a `data.frame` `X` can be subset by a `data.frame` `Y`, leading to the `X[Y]` syntax.
es: Además, las matrices, especialmente las matrices dispersas, a menudo se almacenan en una tupla de 3 columnas: `(i, j, valor)`. Esto se puede considerar como un par clave-valor donde `i` y `j` forman una clave de 2 columnas. Si tenemos más de un valor, quizás de diferentes tipos, podría verse como `(i, j, val1, val2, val3, ...)`. Esto se parece mucho a un `data.frame`. Por lo tanto, data.table extiende `data.frame` de modo que un `data.frame` `X` puede ser subconjunto de un `data.frame` `Y`, lo que lleva a la sintaxis `X[Y]`.

source: Can base be changed to do this then, rather than a new package?
es: ¿Se puede cambiar la base para hacer esto, en lugar de un nuevo paquete?

source: `data.frame` is used _everywhere_ and so it is very difficult to make _any_ changes to it. data.table _inherits_ from `data.frame`. It _is_ a `data.frame`, too. A data.table _can_ be passed to any package that _only_ accepts `data.frame`. When that package uses `[.data.frame` syntax on the data.table, it works. It works because `[.data.table` looks to see where it was called from. If it was called from such a package, `[.data.table` diverts to `[.data.frame`.
es: `data.frame` se usa _en todas partes_ y por eso es muy difícil hacerle _algun_ cambio. data.table _hereda_ de `data.frame`. También _es_ un `data.frame`. Un data.table _se puede_ pasar a cualquier paquete que _solo_ acepte `data.frame`. Cuando ese paquete usa la sintaxis `[.data.frame` en el data.table, funciona. Funciona porque `[.data.table` busca ver desde dónde fue llamado. Si fue llamado desde un paquete así, `[.data.table` desvía a `[.data.frame`.

source: I've heard that data.table syntax is analogous to SQL.
es: He oído que la sintaxis data.table es análoga a SQL.

source: Yes:
es: Sí:

source: ===== - `i` $$$\Leftrightarrow$$$ where===== ===== - `j` $$$\Leftrightarrow$$$ select===== ===== - `:=` $$$\Leftrightarrow$$$ update===== ===== - `by` $$$\Leftrightarrow$$$ group by===== ===== - `i` $$$\Leftrightarrow$$$ order by (in compound syntax)===== ===== - `i` $$$\Leftrightarrow$$$ having (in compound syntax)===== ===== - `nomatch = NA` $$$\Leftrightarrow$$$ outer join===== ===== - `nomatch = NULL` $$$\Leftrightarrow$$$ inner join===== ===== - `mult = "first"|"last"` $$$\Leftrightarrow$$$ N/A because SQL is inherently unordered===== ===== - `roll = TRUE` $$$\Leftrightarrow$$$ N/A because SQL is inherently unordered=====
es: ===== - `i` $$$\Leftrightarrow$$$ donde===== ===== - `j` $$$\Leftrightarrow$$$ seleccionar===== ===== - `:=` $$$\Leftrightarrow$$$ actualizar===== ===== - `por` $$$\Leftrightarrow$$$ agrupar por===== ===== - `i` $$$\Leftrightarrow$$$ ordenar por (en sintaxis compuesta)===== ===== - `i` $$$\Leftrightarrow$$$ tener (en sintaxis compuesta)===== ===== - `nomatch = NA` $$$\Leftrightarrow$$$ unión externa===== ===== - `nomatch = NULL` $$$\Leftrightarrow$$$ unión interna===== ===== - `mult = "first"|"last"` $$$\Leftrightarrow$$$ N/A porque SQL es inherentemente desordenado===== ===== - `roll = TRUE` $$$\Leftrightarrow$$$ N/A porque SQL es inherentemente desordenado=====

source: The general form is:
es: La forma general es:

source: A key advantage of column vectors in R is that they are _ordered_, unlike SQL[^2]. We can use ordered functions in `data.table` queries such as `diff()` and we can use _any_ R function from any package, not just the functions that are defined in SQL. A disadvantage is that R objects must fit in memory, but with several R packages such as `ff`, `bigmemory`, `mmap` and `indexing`, this is changing.
es: Una ventaja clave de los vectores de columna en R es que están _ordenados_, a diferencia de SQL[^2]. Podemos usar funciones ordenadas en consultas `data.table` como `diff()` y podemos usar _cualquier_ función de R de cualquier paquete, no solo las funciones que están definidas en SQL. Una desventaja es que los objetos de R deben caber en la memoria, pero con varios paquetes de R como `ff`, `bigmemory`, `mmap` e `indexing`, esto está cambiando.

source: [^2]: It may be a surprise to learn that `select top 10 * from ...` does _not_ reliably return the same rows over time in SQL. You do need to include an `order by` clause, or use a clustered index to guarantee row order; _i.e._, SQL is inherently unordered.
es: [^2]: Puede resultar sorprendente saber que `select top 10 * from ...` no devuelve de manera confiable las mismas filas a lo largo del tiempo en SQL. Debe incluir una cláusula `order by` o usar un índice agrupado para garantizar el orden de las filas; es decir, SQL es inherentemente desordenado.

source: What are the smaller syntax differences between `data.frame` and data.table {#SmallerDiffs}
es: ¿Cuáles son las diferencias de sintaxis más pequeñas entre `data.frame` y data.table? {#SmallerDiffs}

source: ===== - `DT[3]` refers to the 3rd _row_, but `DF[3]` refers to the 3rd _column_===== ===== - `DT[3, ] == DT[3]`, but `DF[ , 3] == DF[3]` (somewhat confusingly in data.frame, whereas data.table is consistent)===== ===== - For this reason we say the comma is _optional_ in `DT`, but not optional in `DF`===== ===== - `DT[[3]] == DF[, 3] == DF[[3]]`===== ===== - `DT[i, ]`, where `i` is a single integer, returns a single row, just like `DF[i, ]`, but unlike a matrix single-row subset which returns a vector.===== ===== - `DT[ , j]` where `j` is a single integer returns a one-column data.table, unlike `DF[, j]` which returns a vector by default===== ===== - `DT[ , "colA"][[1]] == DF[ , "colA"]`.===== ===== - `DT[ , colA] == DF[ , "colA"]` (currently in data.table v1.9.8 but is about to change, see release notes)===== ===== - `DT[ , list(colA)] == DF[ , "colA", drop = FALSE]`===== ===== - `DT[NA]` returns 1 row of `NA`, but `DF[NA]` returns an entire copy of `DF` containing `NA` throughout. The symbol `NA` is type `logical` in R and is therefore recycled by `[.data.frame`. The user's intention was probably `DF[NA_integer_]`. `[.data.table` diverts to this probable intention automatically, for convenience.===== ===== - `DT[c(TRUE, NA, FALSE)]` treats the `NA` as `FALSE`, but `DF[c(TRUE, NA, FALSE)]` returns===== `NA` rows for each `NA` ===== - `DT[ColA == ColB]` is simpler than `DF[!is.na(ColA) & !is.na(ColB) & ColA == ColB, ]`===== ===== - `data.frame(list(1:2, "k", 1:4))` creates 3 columns, data.table creates one `list` column.===== ===== - `check.names` is by default `TRUE` in `data.frame` but `FALSE` in data.table, for convenience.===== ===== - `data.table` has always set `stringsAsFactors=FALSE` by default. In R 4.0.0 (Apr 2020), `data.frame`'s default was changed from `TRUE` to `FALSE` and there is no longer a difference in this regard; see [stringsAsFactors, Kurt Hornik, Feb 2020]{1}.===== ===== - Atomic vectors in `list` columns are collapsed when printed using `", "` in `data.frame`, but `","` in data.table with a trailing comma after the 6th item to avoid accidental printing of large embedded objects.===== ===== - Unlike data.frames a data.table cannot store rows with no columns, as rows are considered to be the children of columns: `nrow(DF[, 0])` returns the number of rows, while `nrow(DT[, 0])` always returns 0; but see issue [#2422]{2}.=====
es: ===== - `DT[3]` se refiere a la 3ra _fila_, pero `DF[3]` se refiere a la 3ra _columna_===== ===== - `DT[3, ] == DT[3]`, pero `DF[ , 3] == DF[3]` (de manera algo confusa en data.frame, mientras que data.table es consistente)===== ===== - Por esta razón decimos que la coma es _opcional_ en `DT`, pero no opcional en `DF`===== ===== - `DT[[3]] == DF[, 3] == DF[[3]]`===== ===== - `DT[i, ]`, donde `i` es un solo entero, devuelve una sola fila, al igual que `DF[i, ]`, pero a diferencia de un subconjunto de una sola fila de la matriz que devuelve un vector.===== ===== - `DT[ , j]` donde `j` es un entero único, devuelve un data.table de una columna, a diferencia de `DF[, j]` que devuelve un vector de forma predeterminada===== ===== - `DT[ , "colA"][[1]] == DF[ , "colA"]`.===== ===== - `DT[ , colA] == DF[ , "colA"]` (actualmente en data.table v1.9.8 pero está a punto de cambiar, consulte las notas de la versión)===== ===== - `DT[ , list(colA)] == DF[ , "colA", drop = FALSE]`===== ===== - `DT[NA]` devuelve 1 fila de `NA`, pero `DF[NA]` devuelve una copia completa de `DF` que contiene `NA` en todas partes. El símbolo `NA` es de tipo `lógico` en R y, por lo tanto, `[.data.frame` lo recicla. La intención del usuario probablemente era `DF[NA_integer_]`. `[.data.table` desvía a esta intención probable automáticamente, para mayor comodidad.===== ===== - `DT[c(TRUE, NA, FALSE)]` trata a `NA` como `FALSE`, pero `DF[c(TRUE, NA, FALSE)]` devuelve===== `NA` filas para cada `NA` ===== - `DT[ColA == ColB]` es más simple que `DF[!is.na(ColA) & !is.na(ColB) & ColA == ColB, ]`===== ===== - `data.frame(list(1:2, "k", 1:4))` crea 3 columnas, data.table crea una columna `list`.===== ===== - `check.names` es por defecto `TRUE` en `data.frame` pero `FALSE` en data.table, para mayor comodidad.===== ===== - `data.table` siempre ha establecido `stringsAsFactors=FALSE` de forma predeterminada. En R 4.0.0 (abril de 2020), el valor predeterminado de `data.frame` se cambió de `TRUE` a `FALSE` y ya no hay ninguna diferencia en este sentido; - Los vectores atómicos en las columnas de `list` se contraen cuando se imprimen usando `", "` en `data.frame`, pero `","` en data.table con una coma final después del sexto elemento para evitar la impresión accidental de objetos incrustados grandes.===== ===== - A diferencia de data.frames, un data.table no puede almacenar filas sin columnas, ya que las filas se consideran hijas de las columnas: `nrow(DF[, 0])` devuelve el número de filas, mientras que `nrow(DT[, 0])` siempre devuelve 0; pero vea el problema [#2422]{2}.=====

source: In `[.data.frame` we very often set `drop = FALSE`. When we forget, bugs can arise in edge cases where single columns are selected and all of a sudden a vector is returned rather than a single column `data.frame`. In `[.data.table` we took the opportunity to make it consistent and dropped `drop`.
es: En `[.data.frame`, a menudo configuramos `drop = FALSE`. Cuando nos olvidamos, pueden surgir errores en casos extremos en los que se seleccionan columnas individuales y, de repente, se devuelve un vector en lugar de una sola columna `data.frame`. En `[.data.table`, aprovechamos la oportunidad para hacerlo coherente y eliminamos `drop`.

source: When a data.table is passed to a data.table-unaware package, that package is not concerned with any of these differences; it just works.
es: Cuando se pasa un data.table a un paquete que no es compatible con data.table, ese paquete no se preocupa por ninguna de estas diferencias; simplemente funciona.

source: I'm using `j` for its side effect only, but I'm still getting data returned. How do I stop that?
es: Estoy usando `j` solo por su efecto secundario, pero aún así obtengo datos. ¿Cómo puedo detenerlo?

source: In this case `j` can be wrapped with `invisible()`; e.g., `DT[ , invisible(hist(colB)), by = colA]`[^3]
es: En este caso, `j` se puede envolver con `invisible()`; por ejemplo, `DT[ , invisible(hist(colB)), by = colA]`[^3]

source: [^3]: _e.g._, `hist()` returns the breakpoints in addition to plotting to the graphics device.
es: [^3]: _p. ej._, `hist()` devuelve los puntos de interrupción además de trazar en el dispositivo gráfico.

source: Why does `[.data.table` now have a `drop` argument from v1.5?
es: ¿Por qué `[.data.table` ahora tiene un argumento `drop` desde v1.5?

source: So that data.table can inherit from `data.frame` without using `...`. If we used `...` then invalid argument names would not be caught.
es: Para que data.table pueda heredar de `data.frame` sin usar `...`. Si usáramos `...`, no se detectarían los nombres de argumentos no válidos.

source: The `drop` argument is never used by `[.data.table`. It is a placeholder for non-data.table-aware packages when they use the `[.data.frame` syntax directly on a data.table.
es: El argumento `drop` nunca lo utiliza `[.data.table`. Es un marcador de posición para paquetes que no son compatibles con data.table cuando utilizan la sintaxis `[.data.frame` directamente en un data.table.

source: Rolling joins are cool and very fast! Was that hard to program?
es: ¡Las uniones continuas son geniales y muy rápidas! ¿Fue difícil programarlas?

source: The prevailing row on or before the `i` row is the final row the binary search tests anyway. So `roll = TRUE` is essentially just a switch in the binary search C code to return that row.
es: De todos modos, la fila que prevalece sobre la fila `i` o antes es la fila final que prueba la búsqueda binaria. Por lo tanto, `roll = TRUE` es básicamente un cambio en el código C de búsqueda binaria para devolver esa fila.

source: Why does `DT[i, col := value]` return the whole of `DT`? I expected either no visible value (consistent with `<-`), or a message or return value containing how many rows were updated. It isn't obvious that the data has indeed been updated by reference.
es: ¿Por qué `DT[i, col := value]` devuelve el `DT` completo? No esperaba ningún valor visible (coherente con `<-`), o un mensaje o valor de retorno que contenga cuántas filas se actualizaron. No es obvio que los datos hayan sido efectivamente actualizados por referencia.

source: This has changed in v1.8.3 to meet your expectations. Please upgrade.
es: Esto ha cambiado en la versión 1.8.3 para cumplir con tus expectativas. Actualiza.

source: The whole of `DT` is returned (now invisibly) so that compound syntax can work; _e.g._, `DT[i, done := TRUE][ , sum(done)]`. The number of rows updated is returned when `verbose` is `TRUE`, either on a per-query basis or globally using `options(datatable.verbose = TRUE)`.
es: Se devuelve la totalidad de `DT` (ahora de forma invisible) para que la sintaxis compuesta pueda funcionar; por ejemplo, `DT[i, done := TRUE][ , sum(done)]`. La cantidad de filas actualizadas se devuelve cuando `verbose` es `TRUE`, ya sea por consulta o de forma global mediante `options(datatable.verbose = TRUE)`.

source: OK, thanks. What was so difficult about the result of `DT[i, col := value]` being returned invisibly?
es: Vale, gracias. ¿Qué tenía de difícil que el resultado de `DT[i, col := value]` se devolviera de forma invisible?
