Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-faq.Rmd-*.po
Languages: es

source: This error (and similar, _e.g._, "`getCharCE` must be called on a `CHARSXP`") may be nothing do with character data or locale. Instead, this can be a symptom of an earlier memory corruption. To date these have been reproducible and fixed (quickly). Please report it to our [issues tracker]{1}.
es: Este error (y otros similares, por ejemplo, "`getCharCE` debe ser llamado en un `CHARSXP`") puede no tener nada que ver con los datos de caracteres o la configuración regional. En cambio, puede ser un síntoma de una corrupción de memoria anterior. Hasta la fecha, estos errores se han podido reproducir y solucionar (rápidamente). Por favor, repórtelo a nuestro [seguidor de problemas]{1}.

source: `cbind(DT, DF)` returns a strange format, _e.g._ `Integer,5` {#cbinderror}
es: `cbind(DT, DF)` devuelve un formato extraño, _p. ej._ `Integer,5` {#cbinderror}

source: This occurs prior to v1.6.5, for `rbind(DT, DF)` too. Please upgrade to v1.6.7 or later.
es: Esto ocurre antes de la versión 1.6.5, también para `rbind(DT, DF)`. Actualice a la versión 1.6.7 o posterior.

source: "cannot change value of locked binding for `.SD`"
es: "No se puede cambiar el valor del enlace bloqueado para `.SD`"

source: `.SD` is locked by design. See `?data.table`. If you'd like to manipulate `.SD` before using it, or returning it, and don't wish to modify `DT` using `:=`, then take a copy first (see `?copy`), _e.g._,
es: `.SD` está bloqueado por diseño. Consulte `?data.table`. Si desea manipular `.SD` antes de usarlo o devolverlo y no desea modificar `DT` utilizando `:=`, primero haga una copia (consulte `?copy`), _por ejemplo_,

source: "cannot change value of locked binding for `.N`"
es: "No se puede cambiar el valor del enlace bloqueado para `.N`"

source: Please upgrade to v1.8.1 or later. From this version, if `.N` is returned by `j` it is renamed to `N` to avoid any ambiguity in any subsequent grouping between the `.N` special variable and a column called `".N"`.
es: Actualice a la versión 1.8.1 o posterior. A partir de esta versión, si `.N` se devuelve mediante `j`, se le cambia el nombre a `N` para evitar cualquier ambigüedad en cualquier agrupación posterior entre la variable especial `.N` y una columna denominada `".N"`.

source: The old behaviour can be reproduced by forcing `.N` to be called `.N`, like this:
es: El comportamiento anterior se puede reproducir forzando a que `.N` se llame `.N`, de la siguiente manera:

source: If you are already running v1.8.1 or later then the error message is now more helpful than the "cannot change value of locked binding" error, as you can see above, since this vignette was produced using v1.8.1 or later.
es: Si ya está ejecutando v1.8.1 o posterior, entonces el mensaje de error ahora es más útil que el error "no se puede cambiar el valor del enlace bloqueado", como puede ver arriba, ya que esta viñeta se produjo usando v1.8.1 o posterior.

source: The more natural syntax now works:
es: Ahora funciona la sintaxis más natural:

source: Warning messages
es: Mensajes de advertencia

source: "The following object(s) are masked from `package:base`: `cbind`, `rbind`"
es: "Los siguientes objetos están enmascarados de `paquete:base`: `cbind`, `rbind`"

source: This warning was present in v1.6.5 and v.1.6.6 only, when loading the package. The motivation was to allow `cbind(DT, DF)` to work, but as it transpired, this broke (full) compatibility with package `IRanges`. Please upgrade to v1.6.7 or later.
es: Esta advertencia solo estaba presente en las versiones v1.6.5 y v1.6.6, al cargar el paquete. La motivación era permitir que `cbind(DT, DF)` funcionara, pero, como se vio, esto rompió la compatibilidad (total) con el paquete `IRanges`. Actualice a la versión v1.6.7 o posterior.

source: "Coerced numeric RHS to integer to match the column's type"
es: "Se convirtió el RHS numérico a entero para que coincida con el tipo de la columna"

source: Hopefully, this is self explanatory. The full message is:
es: Con suerte, esto se explicará por sí solo. El mensaje completo es:

source: Coerced numeric RHS to integer to match the column's type; may have truncated precision. Either change the column to numeric first by creating a new numeric vector length 5 (nrows of entire table) yourself and assigning that (i.e. 'replace' column), or coerce RHS to integer yourself (e.g. 1L or as.integer) to make your intent clear (and for speed). Or, set the column type correctly up front when you create the table and stick to it, please.
es: Se ha convertido el RHS numérico en entero para que coincida con el tipo de columna; puede tener precisión truncada. Cambie la columna a numérica primero creando usted mismo un nuevo vector numérico de longitud 5 (nfilas de toda la tabla) y asígnelo (es decir, "reemplazar" la columna), o convierta usted mismo el RHS en entero (por ejemplo, 1L o as.integer) para que su intención quede clara (y para acelerar). O bien, configure el tipo de columna correctamente desde el principio cuando cree la tabla y cúmplalo, por favor.

source: To generate it, try:
es: Para generarlo, prueba:

source: Reading data.table from RDS or RData file
es: Lectura de data.table desde un archivo RDS o RData

source: `*.RDS` and `*.RData` are file types which can store in-memory R objects on disk efficiently. However, storing data.table into the binary file loses its column over-allocation. This isn't a big deal -- your data.table will be copied in memory on the next _by reference_ operation and throw a warning. Therefore it is recommended to call `setalloccol()` on each data.table loaded with `readRDS()` or `load()` calls.
es: `*.RDS` y `*.RData` son tipos de archivos que pueden almacenar objetos R en memoria en el disco de manera eficiente. Sin embargo, al almacenar data.table en el archivo binario se pierde la sobreasignación de columnas. Esto no es un gran problema: su data.table se copiará en la memoria en la siguiente operación _por referencia_ y generará una advertencia. Por lo tanto, se recomienda llamar a `setalloccol()` en cada data.table cargado con llamadas `readRDS()` o `load()`.

source: General questions about the package
es: Preguntas generales sobre el paquete

source: v1.3 appears to be missing from the CRAN archive?
es: ¿Parece que la versión v1.3 falta en el archivo CRAN?

source: That is correct. v1.3 was available on R-Forge only. There were several large changes internally and these took some time to test in development.
es: Es correcto. La versión 1.3 solo estaba disponible en R-Forge. Se realizaron varios cambios importantes a nivel interno y llevó un tiempo probarlos durante el desarrollo.

source: Is data.table compatible with S-plus?
es: ¿Es data.table compatible con S-plus?

source: Not currently.
es: No actualmente.

source: ===== - A few core parts of the package are written in C and use internal R functions and R structures.===== ===== - The package uses lexical scoping which is one of the differences between R and **S-plus** explained by [R FAQ 3.3.1]{1}=====
es: ===== - Algunas partes principales del paquete están escritas en C y utilizan funciones y estructuras internas de R.===== ===== - El paquete utiliza alcance léxico, que es una de las diferencias entre R y **S-plus** explicadas en [R FAQ 3.3.1]{1}=====

source: Is it available for Linux, Mac and Windows?
es: ¿Está disponible para Linux, Mac y Windows?

source: Yes, for both 32-bit and 64-bit on all platforms. Thanks to CRAN. There are no special or OS-specific libraries used.
es: Sí, tanto para 32 bits como para 64 bits en todas las plataformas. Gracias a CRAN. No se utilizan bibliotecas especiales ni específicas de ningún sistema operativo.

source: I think it's great. What can I do?
es: Me parece genial ¿Qué puedo hacer?

source: Please file suggestions, bug reports and enhancement requests on our [issues tracker]{1}. This helps make the package better.
es: Envíe sugerencias, informes de errores y solicitudes de mejora a nuestro [seguimiento de problemas]{1}. Esto ayuda a mejorar el paquete.

source: Please do star the package on [GitHub]{1}. This helps encourage the developers and helps other R users find the package.
es: Por favor, marque el paquete con una estrella en [GitHub]{1}. Esto ayuda a alentar a los desarrolladores y ayuda a otros usuarios de R a encontrar el paquete.

source: You can submit pull requests to change the code and/or documentation yourself; see our [Contribution Guidelines]{1}.
es: Puede enviar solicitudes de extracción para cambiar el código y/o la documentación usted mismo; consulte nuestras [Pautas de contribución]{1}.

source: I think it's not great. How do I warn others about my experience?
es: No me parece nada bueno. ¿Cómo puedo advertir a los demás sobre mi experiencia?

source: We add all articles we know about (whether positive or negative) to the [Articles]{1} page. All pages in the project's wiki on GitHub are open-access with no modify restrictions. Feel free to write an article, link to a negative one someone else wrote that you found, or add a new page to our wiki to collect your criticisms. Please make it constructive so we have a chance to improve.
es: Agregamos todos los artículos que conocemos (ya sean positivos o negativos) a la página [Artículos]{1}. Todas las páginas en la wiki del proyecto en GitHub son de acceso abierto sin restricciones de modificación. Siéntete libre de escribir un artículo, vincular a un artículo negativo que alguien más haya escrito y que hayas encontrado, o agregar una nueva página a nuestra wiki para recopilar tus críticas. Haz que sea constructiva para que tengamos la oportunidad de mejorar.

source: I have a question. I know the r-help posting guide tells me to contact the maintainer (not r-help), but is there a larger group of people I can ask?
es: Tengo una pregunta. Sé que la guía de publicación de R-Help me indica que me comunique con el encargado del mantenimiento (no con R-Help), pero ¿hay un grupo más grande de personas a quienes pueda preguntar?

source: Please see the [support guide]{1} on the project's homepage which contains up-to-date links.
es: Consulte la [guía de soporte]{1} en la página de inicio del proyecto, que contiene enlaces actualizados.

source: Where are the datatable-help archives?
es: ¿Dónde están los archivos de ayuda de datatable?

source: The [homepage]{1} contains links to the archives in several formats.
es: La [página de inicio]{1} contiene enlaces a los archivos en varios formatos.

source: I'd prefer not to post on the Issues page, can I mail just one or two people privately?
es: Preferiría no publicar en la página de Problemas, ¿puedo enviar un correo electrónico privado a una o dos personas?

source: Sure. You're more likely to get a faster answer from the Issues page or Stack Overflow, though. Further, asking publicly in those places helps build the general knowledge base.
es: Por supuesto. Sin embargo, es más probable que obtengas una respuesta más rápida en la página de problemas o en Stack Overflow. Además, preguntar públicamente en esos lugares ayuda a construir la base de conocimiento general.

source: I have created a package that uses data.table. How do I ensure my package is data.table-aware so that inheritance from `data.frame` works?
es: He creado un paquete que utiliza data.table. ¿Cómo puedo asegurarme de que mi paquete sea compatible con data.table para que funcione la herencia de `data.frame`?

source: Please see [this answer]{1}.
es: Por favor vea [esta respuesta]{1}.
