Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-faq.Rmd-*.po
Languages: es

source: R internally forces visibility on for `[`. The value of FunTab's eval column (see [src/main/names.c]{1}) for `[` is `0` meaning "force `R_Visible` on" (see [R-Internals section 1.6]{2} ). Therefore, when we tried `invisible()` or setting `R_Visible` to `0` directly ourselves, `eval` in [src/main/eval.c]{3} would force it on again.
es: R activa internamente la visibilidad para `[`. El valor de la columna eval de FunTab (ver [src/main/names.c]{1}) para `[` es `0`, lo que significa que "activar `R_Visible`" (ver [R-Internals sección 1.6]{2}). Por lo tanto, cuando probamos `invisible()` o configuramos `R_Visible` en `0` directamente nosotros mismos, `eval` en [src/main/eval.c]{3} lo activaría nuevamente.

source: To solve this problem, the key was to stop trying to stop the print method running after a `:=`. Instead, inside `:=` we now (from v1.8.3) set a global flag which the print method uses to know whether to actually print or not.
es: Para resolver este problema, la clave fue dejar de intentar detener la ejecución del método de impresión después de un `:=`. En cambio, dentro de `:=` ahora (a partir de la versión 1.8.3) configuramos un indicador global que el método de impresión usa para saber si realmente debe imprimir o no.

source: Why do I have to type `DT` sometimes twice after using `:=` to print the result to console?
es: ¿Por qué a veces tengo que escribir `DT` dos veces después de usar `:=` para imprimir el resultado en la consola?

source: This is an unfortunate downside to get [#869]{1} to work. If a `:=` is used inside a function with no `DT[]` before the end of the function, then the next time `DT` is typed at the prompt, nothing will be printed. A repeated `DT` will print. To avoid this: include a `DT[]` after the last `:=` in your function. If that is not possible (e.g., it's not a function you can change) then `print(DT)` and `DT[]` at the prompt are guaranteed to print. As before, adding an extra `[]` on the end of `:=` query is a recommended idiom to update and then print; e.g.> `DT[,foo:=3L][]`.
es: Este es un inconveniente desafortunado para que [#869]{1} funcione. Si se usa un `:=` dentro de una función sin `DT[]` antes del final de la función, entonces la próxima vez que se escriba `DT` en el indicador, no se imprimirá nada. Se imprimirá un `DT` repetido. Para evitar esto: incluya un `DT[]` después del último `:=` en su función. Si eso no es posible (por ejemplo, no es una función que puede cambiar), entonces se garantiza que se imprimirán `print(DT)` y `DT[]` en el indicador. Como antes, agregar un `[]` adicional al final de la consulta `:=` es un modismo recomendado para actualizar y luego imprimir; por ejemplo, `DT[,foo:=3L][]`.

source: I've noticed that `base::cbind.data.frame` (and `base::rbind.data.frame`) appear to be changed by data.table. How is this possible? Why?
es: He observado que `base::cbind.data.frame` (y `base::rbind.data.frame`) parecen haber sido modificados por data.table. ¿Cómo es posible? ¿Por qué?

source: It was a temporary, last resort solution before rbind and cbind S3 method dispatch was fixed in R >= 4.0.0. Essentially, the issue was that `data.table` inherits from `data.frame`, _and_ `base::cbind` and `base::rbind` (uniquely) do their own S3 dispatch internally as documented by `?cbind`. The `data.table` workaround was adding one `for` loop to the start of each function directly in `base`. That modification was made dynamically, _i.e._, the `base` definition of `cbind.data.frame` was fetched, the `for` loop added to the beginning, and then assigned back to `base`. This solution was designed to be robust to different definitions of `base::cbind.data.frame` in different versions of R, including unknown future changes. It worked well. The competing requirements were:
es: Fue una solución temporal, de último recurso, antes de que se solucionara el envío de métodos S3 de rbind y cbind en R >= 4.0.0. Básicamente, el problema era que `data.table` hereda de `data.frame`, _y_ `base::cbind` y `base::rbind` (de manera única) realizan su propio envío S3 internamente, como lo documenta `?cbind`. La solución alternativa de `data.table` fue agregar un bucle `for` al comienzo de cada función directamente en `base`. Esa modificación se realizó de manera dinámica, _es decir_, se obtuvo la definición `base` de `cbind.data.frame`, se agregó el bucle `for` al comienzo y luego se asignó nuevamente a `base`. Esta solución fue diseñada para ser robusta ante diferentes definiciones de `base::cbind.data.frame` en diferentes versiones de R, incluidos cambios futuros desconocidos. Funcionó bien. Los requisitos en competencia fueron:

source: ===== - `cbind(DT, DF)` needs to work. Defining `cbind.data.table` didn't work because `base::cbind` does its own S3 dispatch and required (before R 4.0.0) that the _first_ `cbind` method for each object it is passed is _identical_. This is not true in `cbind(DT, DF)` because the first method for `DT` is `cbind.data.table` but the first method for `DF` is `cbind.data.frame`. `base::cbind` then fell through to its internal `bind` code which appears to treat `DT` as a regular `list` and returns very odd looking and unusable `matrix` output. See [below]{1}. We cannot just advise users not to call `cbind(DT, DF)` because packages such as `ggplot2` make such a call ([test 167.2]{2}).=====
es: ===== - `cbind(DT, DF)` debe funcionar. La definición de `cbind.data.table` no funcionó porque `base::cbind` realiza su propio envío S3 y requería (antes de R 4.0.0) que el _primer_ método `cbind` para cada objeto que se le pasa sea _idéntico_. Esto no es cierto en `cbind(DT, DF)` porque el primer método para `DT` es `cbind.data.table` pero el primer método para `DF` es `cbind.data.frame`. `base::cbind` luego pasó a su código `bind` interno que parece tratar a `DT` como una `lista` regular y devuelve una salida `matrix` de aspecto muy extraño e inutilizable. Consulte [a continuación]{1}. No podemos simplemente recomendar a los usuarios que no llamen a `cbind(DT, DF)` porque paquetes como `ggplot2` hacen dicha llamada ([prueba 167.2]{2}).=====

source: ===== - This naturally led to trying to mask `cbind.data.frame` instead. Since a data.table is a `data.frame`, `cbind` would find the same method for both `DT` and `DF`. However, this didn't work either because `base::cbind` appears to find methods in `base` first; _i.e._, `base::cbind.data.frame` isn't maskable.=====
es: ===== - Esto naturalmente llevó a intentar enmascarar `cbind.data.frame` en su lugar. Dado que un data.table es un `data.frame`, `cbind` encontraría el mismo método tanto para `DT` como para `DF`. Sin embargo, esto tampoco funcionó porque `base::cbind` parece encontrar métodos en `base` primero; _es decir_, `base::cbind.data.frame` no se puede enmascarar.=====

source: ===== - Finally, we tried masking `cbind` itself (v1.6.5 and v1.6.6). This allowed `cbind(DT, DF)` to work, but introduced compatibility issues with package `IRanges`, since `IRanges` also masks `cbind`. It worked if `IRanges` was lower on the `search()` path than data.table, but if `IRanges` was higher then data.table's, `cbind` would never be called and the strange-looking `matrix` output occurs again (see [below]{1}).=====
es: ===== - Finalmente, intentamos enmascarar `cbind` en sí (v1.6.5 y v1.6.6). Esto permitió que `cbind(DT, DF)` funcionara, pero introdujo problemas de compatibilidad con el paquete `IRanges`, ya que `IRanges` también enmascara `cbind`. Funcionó si `IRanges` estaba más abajo en la ruta `search()` que data.table, pero si `IRanges` estaba más arriba que data.table, `cbind` nunca se llamaría y la salida de `matrix` de aspecto extraño se produciría nuevamente (ver [a continuación]{1}).=====

source: Many thanks to the R core team for fixing the issue in Sep 2019. data.table v1.12.6+ no longer applies the workaround in R >= 4.0.0.
es: Muchas gracias al equipo central de R por solucionar el problema en septiembre de 2019. data.table v1.12.6+ ya no aplica la solución alternativa en R >= 4.0.0.

source: I've read about method dispatch (_e.g._ `merge` may or may not dispatch to `merge.data.table`) but _how_ does R know how to dispatch? Are dots significant or special? How on earth does R know which function to dispatch and when? {#r-dispatch}
es: He leído sobre el envío de métodos (por ejemplo, `merge` puede o no enviarse a `merge.data.table`) pero ¿cómo sabe R cómo enviarlos? ¿Los puntos son importantes o especiales? ¿Cómo sabe R qué función enviar y cuándo? {#r-dispatch}

source: This comes up quite a lot but it's really earth-shatteringly simple. A function such as `merge` is _generic_ if it consists of a call to `UseMethod`. When you see people talking about whether or not functions are _generic_ functions they are merely typing the function without `()` afterwards, looking at the program code inside it and if they see a call to `UseMethod` then it is _generic_. What does `UseMethod` do? It literally slaps the function name together with the class of the first argument, separated by period (`.`) and then calls that function, passing along the same arguments. It's that simple. For example, `merge(X, Y)` contains a `UseMethod` call which means it then _dispatches_ (i.e. calls) `paste("merge", class(X), sep = ".")`. Functions with dots in their name may or may not be methods. The dot is irrelevant really, other than dot being the separator that `UseMethod` uses. Knowing this background should now highlight why, for example, it is obvious to R folk that `as.data.table.data.frame` is the `data.frame` method for the `as.data.table` generic function. Further, it may help to elucidate that, yes, you are correct, it is not obvious from its name alone that `ls.fit` is not the fit method of the `ls` generic function. You only know that by typing `ls` (not `ls()`) and observing it isn't a single call to `UseMethod`.
es: Esto se menciona con mucha frecuencia, pero es realmente muy simple. Una función como `merge` es _genérica_ si consiste en una llamada a `UseMethod`. Cuando ves a gente hablando sobre si las funciones son o no funciones _genéricas_, simplemente están escribiendo la función sin `()` después, mirando el código del programa dentro de ella y si ven una llamada a `UseMethod` entonces es _genérica_. ¿Qué hace `UseMethod`? Literalmente junta el nombre de la función con la clase del primer argumento, separados por un punto (`.`) y luego llama a esa función, pasando los mismos argumentos. Es así de simple. Por ejemplo, `merge(X, Y)` contiene una llamada a `UseMethod`, lo que significa que luego _despacha_ (es decir, llama) a `paste("merge", class(X), sep = ".")`. Las funciones con puntos en su nombre pueden ser métodos o no. El punto es realmente irrelevante, más allá de que el punto es el separador que utiliza `UseMethod`. Conocer estos antecedentes debería ahora resaltar por qué, por ejemplo, es obvio para la gente de R que `as.data.table.data.frame` es el método `data.frame` para la función genérica `as.data.table`. Además, puede ayudar a aclarar que, sí, tienes razón, no es obvio solo por su nombre que `ls.fit` no sea el método fit de la función genérica `ls`. Solo puedes saberlo escribiendo `ls` (no `ls()`) y observando que no es una sola llamada a `UseMethod`.

source: You might now ask: where is this documented in R? Answer: it's quite clear, but, you need to first know to look in `?UseMethod` and _that_ help file contains:
es: Ahora te preguntarás: ¿dónde está documentado esto en R? Respuesta: está bastante claro, pero primero debes saber que debes buscar en `?UseMethod` y _ese_ archivo de ayuda contiene:

source: When a function calling `UseMethod('fun')` is applied to an object with class attribute `c('first', 'second')`, the system searches for a function called `fun.first` and, if it finds it, applies it to the object. If no such function is found a function called `fun.second` is tried. If no class name produces a suitable function, the function `fun.default` is used, if it exists, or an error results.
es: Cuando se aplica una función que llama a `UseMethod('fun')` a un objeto con el atributo de clase `c('first', 'second')`, el sistema busca una función llamada `fun.first` y, si la encuentra, la aplica al objeto. Si no se encuentra dicha función, se intenta una función llamada `fun.second`. Si ningún nombre de clase produce una función adecuada, se utiliza la función `fun.default`, si existe, o se produce un error.

source: Happily, an internet search for "How does R method dispatch work" (at the time of this writing) returns the `?UseMethod` help page in the top few links. Admittedly, other links rapidly descend into the intricacies of S3 vs S4, internal generics and so on.
es: Afortunadamente, una búsqueda en Internet de "Cómo funciona el envío de métodos R" (en el momento de escribir este artículo) devuelve la página de ayuda "UseMethod" entre los primeros enlaces. Es cierto que otros enlaces descienden rápidamente a las complejidades de S3 vs. S4, genéricos internos, etc.

source: However, features like basic S3 dispatch (pasting the function name together with the class name) is why some R folk love R. It's so simple. No complicated registration or signature is required. There isn't much needed to learn. To create the `merge` method for data.table all that was required, literally, was to merely create a function called `merge.data.table`.
es: Sin embargo, características como el envío básico de S3 (pegar el nombre de la función junto con el nombre de la clase) es la razón por la que a algunas personas de R les encanta. Es muy simple. No se requiere ningún registro o firma complicados. No hay mucho que aprender. Para crear el método `merge` para data.table, todo lo que se requirió, literalmente, fue simplemente crear una función llamada `merge.data.table`.

source: Why do `T` and `F` behave differently from `TRUE` and `FALSE` in some `data.table` queries?
es: ¿Por qué `T` y `F` se comportan de manera diferente a `TRUE` y `FALSE` en algunas consultas `data.table`?

source: Using `T` and `F` as abbreviations for `TRUE` and `FALSE` in `data.table` can lead to unexpected behavior. This is because `T` and `F` are global variables that can be redefined, which causes them to be treated as variable names rather than logical constants. This issue does not occur with `TRUE` and `FALSE`. Avoiding `T` and `F` is advice for using R generally, but it shows up in `data.table` in some perhaps surprising ways, for example:
es: El uso de `T` y `F` como abreviaturas de `TRUE` y `FALSE` en `data.table` puede generar un comportamiento inesperado. Esto se debe a que `T` y `F` son variables globales que se pueden redefinir, lo que hace que se las trate como nombres de variables en lugar de como constantes lógicas. Este problema no ocurre con `TRUE` y `FALSE`. Se recomienda evitar `T` y `F` para usar R en general, pero aparece en `data.table` de formas quizás sorprendentes, por ejemplo:

source: As a general word of advice, `lintr::T_and_F_symbol_linter()` detects the usage of `T` and `F` and suggests replacing them with `TRUE` and `FALSE` to avoid such issues.
es: Como consejo general, `lintr::T_and_F_symbol_linter()` detecta el uso de `T` y `F` y sugiere reemplazarlos con `TRUE` y `FALSE` para evitar tales problemas.

source: Questions relating to compute time
es: Preguntas relacionadas con el tiempo de cómputo

source: I have 20 columns and a large number of rows. Why is an expression of one column so quick?
es: Tengo 20 columnas y una gran cantidad de filas. ¿Por qué una expresión de una columna es tan rápida?

source: Several reasons:
es: Varias razones:

source: ===== - Only that column is grouped, the other 19 are ignored because data.table inspects the `j` expression and realises it doesn't use the other columns.===== ===== - One memory allocation is made for the largest group only, then that memory is re-used for the other groups. There is very little garbage to collect.===== ===== - R is an in-memory column store; i.e., the columns are contiguous in RAM. Page fetches from RAM into L2 cache are minimised.=====
es: ===== - Solo se agrupa esa columna, las otras 19 se ignoran porque data.table inspecciona la expresión `j` y se da cuenta de que no usa las otras columnas.===== ===== - Se realiza una asignación de memoria solo para el grupo más grande, luego esa memoria se reutiliza para los otros grupos. Hay muy poca basura para recolectar.===== ===== - R es un almacén de columnas en memoria; es decir, las columnas son contiguas en RAM. Se minimizan las recuperaciones de páginas desde la RAM hacia la caché L2.=====

source: I don't have a `key` on a large table, but grouping is still really quick. Why is that?
es: No tengo una "clave" en una tabla grande, pero aun así la agrupación es muy rápida. ¿Por qué?

source: data.table uses radix sorting. This is significantly faster than other sort algorithms. See [our presentations]{1} for more information, in particular from useR!2015 Denmark.
es: data.table utiliza ordenación por radio. Esto es significativamente más rápido que otros algoritmos de ordenación. Consulte [nuestras presentaciones]{1} para obtener más información, en particular la de useR!2015 Dinamarca.

source: This is also one reason why `setkey()` is quick.
es: Esta es también una razón por la que `setkey()` es rápido.

source: When no `key` is set, or we group in a different order from that of the key, we call it an _ad hoc_ `by`.
es: Cuando no se establece ninguna `clave`, o agrupamos en un orden diferente al de la clave, lo llamamos un `por` _ad hoc_.

source: Why is grouping by columns in the key faster than an _ad hoc_ `by`?
es: ¿Por qué la agrupación por columnas en la clave es más rápida que un `por` _ad hoc_?

source: Because each group is contiguous in RAM, thereby minimising page fetches and memory can be copied in bulk (`memcpy` in C) rather than looping in C.
es: Debido a que cada grupo es contiguo en la RAM, se minimizan las recuperaciones de páginas y la memoria se puede copiar en masa (`memcpy` en C) en lugar de realizar un bucle en C.

source: What are primary and secondary indexes in data.table?
es: ¿Qué son los índices primarios y secundarios en data.table?

source: Manual: [`?setkey`]{1} S.O.: [What is the purpose of setting a key in data.table?]{2}
es: Manual: [`?setkey`]{1} SO: [¿Cuál es el propósito de configurar una clave en data.table?]{2}

source: `setkey(DT, col1, col2)` orders the rows by column `col1` then within each group of `col1` it orders by `col2`. This is a _primary index_. The row order is changed _by reference_ in RAM. Subsequent joins and groups on those key columns then take advantage of the sort order for efficiency. (Imagine how difficult looking for a phone number in a printed telephone directory would be if it wasn't sorted by surname then forename. That's literally all `setkey` does. It sorts the rows by the columns you specify.) The index doesn't use any RAM. It simply changes the row order in RAM and marks the key columns. Analogous to a _clustered index_ in SQL.
es: `setkey(DT, col1, col2)` ordena las filas por la columna `col1` y luego, dentro de cada grupo de `col1`, ordena por `col2`. Este es un _índice primario_. El orden de las filas se cambia _por referencia_ en la RAM. Las uniones y grupos posteriores en esas columnas clave aprovechan el orden de clasificación para lograr eficiencia. (Imagínese lo difícil que sería buscar un número de teléfono en una guía telefónica impresa si no estuviera ordenado por apellido y luego por nombre. Eso es literalmente todo lo que hace `setkey`. Ordena las filas por las columnas que especifique). El índice no utiliza ninguna RAM. Simplemente cambia el orden de las filas en la RAM y marca las columnas clave. Análogo a un _índice agrupado_ en SQL.

source: However, you can only have one primary key because data can only be physically sorted in RAM in one way at a time. Choose the primary index to be the one you use most often (e.g. `[id,date]`). Sometimes there isn't an obvious choice for the primary key or you need to join and group many different columns in different orders. Enter a secondary index. This does use memory (`4*nrow` bytes regardless of the number of columns in the index) to store the order of the rows by the columns you specify, but doesn't actually reorder the rows in RAM. Subsequent joins and groups take advantage of the secondary key's order but need to _hop_ via that index so aren't as efficient as primary indexes. But still, a lot faster than a full vector scan. There is no limit to the number of secondary indexes since each one is just a different ordering vector. Typically you don't need to create secondary indexes. They are created automatically and used for you automatically by using data.table normally; _e.g._ `DT[someCol == someVal, ]` and `DT[someCol %in% someVals, ]` will create, attach and then use the secondary index. This is faster in data.table than a vector scan so automatic indexing is on by default since there is no up-front penalty. There is an option to turn off automatic indexing; _e.g._, if somehow many indexes are being created and even the relatively small amount of extra memory becomes too large.
es: Sin embargo, solo puede tener una clave principal porque los datos solo se pueden ordenar físicamente en RAM de una manera a la vez. Elija el índice principal para que sea el que use con más frecuencia (por ejemplo, `[id, fecha]`). A veces no hay una opción obvia para la clave principal o necesita unir y agrupar muchas columnas diferentes en diferentes órdenes. Ingrese un índice secundario. Esto usa memoria (`4*nrow` bytes independientemente del número de columnas en el índice) para almacenar el orden de las filas por las columnas que especifique, pero en realidad no reordena las filas en RAM. Las uniones y grupos posteriores aprovechan el orden de la clave secundaria, pero necesitan _saltar_ a través de ese índice, por lo que no son tan eficientes como los índices primarios. Pero aún así, mucho más rápido que un escaneo vectorial completo. No hay límite para la cantidad de índices secundarios, ya que cada uno es solo un vector de ordenamiento diferente. Por lo general, no necesita crear índices secundarios. Se crean automáticamente y se usan automáticamente al usar data.table normalmente; _p. ej._ `DT[someCol == someVal, ]` y `DT[someCol %in% someVals, ]` crearán, adjuntarán y luego usarán el índice secundario. Esto es más rápido en data.table que un escaneo vectorial, por lo que la indexación automática está activada de manera predeterminada, ya que no hay una penalización inicial. Hay una opción para desactivar la indexación automática; _p. ej._, si de alguna manera se están creando muchos índices e incluso la cantidad relativamente pequeña de memoria adicional se vuelve demasiado grande.

source: We use the words _index_ and _key_ interchangeably.
es: Utilizamos las palabras _índice_ y _clave_ indistintamente.

source: Error messages
es: Mensajes de error

source: "Could not find function `DT`"
es: "No se pudo encontrar la función `DT`"

source: See above [here]{1} and [here]{2}.
es: Véase arriba [aquí]{1} y [aquí]{2}.

source: "unused argument(s) (`MySum = sum(v)`)"
es: "argumento(s) no utilizado(s) (`MySum = sum(v)`)"

source: This error is generated by `DT[ , MySum = sum(v)]`. `DT[ , .(MySum = sum(v))]` was intended, or `DT[ , j = .(MySum = sum(v))]`.
es: Este error es generado por `DT[ , MySum = sum(v)]`. Se pretendía `DT[ , .(MySum = sum(v))]`, o `DT[ , j = .(MySum = sum(v))]`.

source: "`translateCharUTF8` must be called on a `CHARSXP`"
es: "`translateCharUTF8` debe llamarse en un `CHARSXP`"
