Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-faq.Rmd-*.po
Languages: es

source: The first section, Beginner FAQs, is intended to be read in order, from start to finish. It's just written in a FAQ style to be digested more easily. It isn't really the most frequently asked questions. A better measure for that is looking on Stack Overflow.
es: La primera sección, Preguntas frecuentes para principiantes, está pensada para leerse en orden, de principio a fin. Está escrita en un estilo de preguntas frecuentes para que sea más fácil de digerir. En realidad, no son las preguntas más frecuentes. Una mejor manera de hacerlo es buscar en Stack Overflow.

source: This FAQ is required reading and considered core documentation. Please do not ask questions on Stack Overflow or raise issues on GitHub until you have read it. We can all tell when you ask that you haven't read it. So if you do ask and haven't read it, don't use your real name.
es: Estas preguntas frecuentes son de lectura obligatoria y se consideran documentación básica. No hagas preguntas en Stack Overflow ni plantees problemas en GitHub hasta que las hayas leído. Todos sabemos que cuando preguntas no las has leído. Por lo tanto, si preguntas y no las has leído, no uses tu nombre real.

source: This document has been quickly revised given the changes in v1.9.8 released Nov 2016. Please do submit pull requests to fix mistakes or improvements. If anyone knows why the table of contents comes out so narrow and squashed when displayed by CRAN, please let us know. This document used to be a PDF and we changed it recently to HTML.
es: Este documento ha sido revisado rápidamente debido a los cambios en la versión 1.9.8 publicada en noviembre de 2016. Envíe solicitudes de incorporación de cambios para corregir errores o realizar mejoras. Si alguien sabe por qué la tabla de contenidos aparece tan estrecha y aplastada cuando la muestra CRAN, infórmenos. Este documento solía ser un PDF y lo cambiamos recientemente a HTML.

source: Beginner FAQs
es: Preguntas frecuentes para principiantes

source: Why do `DT[ , 5]` and `DT[2, 5]` return a 1-column data.table rather than vectors like `data.frame`? {#j-num}
es: ¿Por qué `DT[, 5]` y `DT[2, 5]` devuelven una tabla de datos de una columna en lugar de vectores como `data.frame`? {#j-num}

source: For consistency so that when you use data.table in functions that accept varying inputs, you can rely on `DT[...]` returning a data.table. You don't have to remember to include `drop=FALSE` like you do in data.frame. data.table was first released in 2006 and this difference to data.frame has been a feature since the very beginning.
es: Para mantener la coherencia, cuando utilice data.table en funciones que aceptan entradas variables, puede confiar en que `DT[...]` devolverá un data.table. No tiene que recordar incluir `drop=FALSE` como lo hace en data.frame. data.table se lanzó por primera vez en 2006 y esta diferencia con data.frame ha sido una característica desde el principio.

source: You may have heard that it is generally bad practice to refer to columns by number rather than name, though. If your colleague comes along and reads your code later they may have to hunt around to find out which column is number 5. If you or they change the column ordering higher up in your R program, you may produce wrong results with no warning or error if you forget to change all the places in your code which refer to column number 5. That is your fault not R's or data.table's. It's really really bad. Please don't do it. It's the same mantra as professional SQL developers have: never use `select *`, always explicitly select by column name to at least try to be robust to future changes.
es: Es posible que hayas oído que, en general, es una mala práctica hacer referencia a las columnas por número en lugar de por nombre. Si tu colega viene y lee tu código más tarde, es posible que tenga que buscar por todas partes para averiguar qué columna es la número 5. Si tú o ellos cambian el orden de las columnas más arriba en tu programa R, puedes producir resultados erróneos sin advertencia ni error si olvidas cambiar todos los lugares en tu código que hacen referencia a la columna número 5. Eso es culpa tuya, no de R ni de data.table. Es realmente muy malo. Por favor, no lo hagas. Es el mismo mantra que tienen los desarrolladores profesionales de SQL: nunca uses `select *`, siempre selecciona explícitamente por nombre de columna para al menos intentar ser robusto a cambios futuros.

source: Say column 5 is named `"region"` and you really must extract that column as a vector not a data.table. It is more robust to use the column name and write `DT$region` or `DT[["region"]]`; i.e., the same as base R. Using base R's `$` and `[[` on data.table is encouraged. Not when combined with `<-` to assign (use `:=` instead for that) but just to select a single column by name they are encouraged.
es: Digamos que la columna 5 se llama `"region"` y realmente debe extraer esa columna como un vector, no como un data.table. Es más robusto usar el nombre de la columna y escribir `DT$region` o `DT[["region"]]`; es decir, lo mismo que la base R. Se recomienda usar `$` y `[[` de la base R en data.table. No cuando se combinan con `<-` para asignar (use `:=` en su lugar para eso) sino solo para seleccionar una sola columna por nombre.

source: There are some circumstances where referring to a column by number seems like the only way, such as a sequence of columns. In these situations just like data.frame, you can write `DT[, 5:10]` and `DT[,c(1,4,10)]`. However, again, it is more robust (to future changes in your data's number of and ordering of columns) to use a named range such as `DT[,columnRed:columnViolet]` or name each one `DT[,c("columnRed","columnOrange","columnYellow")]`. It is harder work up front, but you will probably thank yourself and your colleagues might thank you in the future. At least you can say you tried your best to write robust code if something does go wrong.
es: Existen algunas circunstancias en las que hacer referencia a una columna por número parece ser la única manera, como en el caso de una secuencia de columnas. En estas situaciones, al igual que en data.frame, puede escribir `DT[, 5:10]` y `DT[,c(1,4,10)]`. Sin embargo, nuevamente, es más robusto (para cambios futuros en el número y orden de las columnas de sus datos) usar un rango con nombre como `DT[,columnRed:columnViolet]` o nombrar cada una de ellas `DT[,c("columnRed","columnOrange","columnYellow")]`. Es un trabajo más arduo al principio, pero probablemente se lo agradecerá a usted mismo y sus colegas podrían agradecérselo en el futuro. Al menos puede decir que hizo lo mejor que pudo para escribir un código sólido si algo sale mal.

source: However, what we really want you to do is `DT[,.(columnRed,columnOrange,columnYellow)]`; i.e., use column names as if they are variables directly inside `DT[...]`. You don't have to prefix each column with `DT$` like you do in data.frame. The `.()` part is just an alias for `list()` and you can use `list()` instead if you prefer. You can place any R expression of column names, using any R package, returning different types of different lengths, right there. We wanted to encourage you to do that so strongly in the past that we deliberately didn't make `DT[,5]` work at all. Before v1.9.8 released Nov 2016, `DT[,5]` used to just return `5`. The thinking was that we could more simply teach one fact that the parts inside `DT[...]` get evaluated within the frame of DT always (they see column names as if they are variables). And `5` evaluates to `5` so that behaviour was consistent with the single rule. We asked you to go through an extra deliberate hurdle `DT[,5,with=FALSE]` if you really wanted to select a column by name or number. Going forward from Nov 2016, you don't need to use `with=FALSE` and we'll see how greater consistency with data.frame in this regard will help or hinder both new and long-time users. The new users who don't read this FAQ, not even this very first entry, will hopefully not stumble as soon with data.table as they did before if they had expected it to work like data.frame. Hopefully they will not miss out on understanding our intent and recommendation to place expressions of columns inside `DT[i, j, by]`. If they use data.table like data.frame they won't gain any benefits. If you know anyone like that, please give them a friendly nudge to read this document like you are.
es: Sin embargo, lo que realmente queremos que hagas es `DT[,.(columnRed,columnOrange,columnYellow)]`; es decir, usar los nombres de columna como si fueran variables directamente dentro de `DT[...]`. No tienes que anteponer cada columna con `DT$` como lo haces en data.frame. La parte `.()` es solo un alias para `list()` y puedes usar `list()` en su lugar si lo prefieres. Puedes colocar cualquier expresión R de nombres de columna, usando cualquier paquete R, devolviendo diferentes tipos de diferentes longitudes, allí mismo. Queríamos alentarte a hacer eso con tanta fuerza en el pasado que deliberadamente no hicimos que `DT[,5]` funcionara en absoluto. Antes de que se lanzara v1.9.8 en noviembre de 2016, `DT[,5]` solía devolver simplemente `5`. La idea era que podíamos enseñar de manera más simple un hecho: las partes dentro de `DT[...]` siempre se evalúan dentro del marco de DT (ven los nombres de columna como si fueran variables). Y `5` evalúa a `5`, por lo que el comportamiento era coherente con la regla única. Te pedimos que pasaras por un obstáculo deliberado adicional `DT[,5,with=FALSE]` si realmente querías seleccionar una columna por nombre o número. A partir de noviembre de 2016, no necesitas usar `with=FALSE` y veremos cómo una mayor coherencia con data.frame en este sentido ayudará o perjudicará tanto a los usuarios nuevos como a los antiguos. Los nuevos usuarios que no lean estas preguntas frecuentes, ni siquiera esta primera entrada, con suerte no tropezarán tan pronto con data.table como lo hicieron antes si esperaban que funcionara como data.frame. Con suerte, no perderán la oportunidad de comprender nuestra intención y recomendación de colocar expresiones de columnas dentro de `DT[i, j, by]`. Si usan data.table como data.frame, no obtendrán ningún beneficio. Si conoces a alguien así, dale un empujoncito amistoso para que lea este documento como lo haces tú.

source: Reminder: you can place _any_ R expression inside `DT[...]` using column names as if they are variables; e.g., try `DT[, colA*colB/2]`. That does return a vector because you used column names as if they are variables. Wrap with `.()` to return a data.table; i.e. `DT[,.(colA*colB/2)]`. Name it: `DT[,.(myResult = colA*colB/2)]`. And we'll leave it to you to guess how to return two things from this query. It's also quite common to do a bunch of things inside an anonymous body: `DT[, { x<-colA+10; x*x/2 }]` or call another package's function: `DT[ , fitdistr(columnA, "normal")]`.
es: Recordatorio: puedes colocar _cualquier_ expresión R dentro de `DT[...]` usando nombres de columna como si fueran variables; por ejemplo, prueba `DT[, colA*colB/2]`. Eso devuelve un vector porque usaste nombres de columna como si fueran variables. Encierra con `.()` para devolver una tabla de datos; es decir, `DT[,.(colA*colB/2)]`. Nómbrala: `DT[,.(myResult = colA*colB/2)]`. Y te dejaremos que adivines cómo devolver dos cosas de esta consulta. También es bastante común hacer un montón de cosas dentro de un cuerpo anónimo: `DT[, { x<-colA+10; x*x/2 }]` o llamar a la función de otro paquete: `DT[ , fitdistr(columnA, "normal")]`.

source: Why does `DT[,"region"]` return a 1-column data.table rather than a vector?
es: ¿Por qué `DT[,"region"]` devuelve una tabla de datos de 1 columna en lugar de un vector?

source: See the [answer above]{1}. Try `DT$region` instead. Or `DT[["region"]]`.
es: Consulte la [respuesta anterior]{1}. Pruebe `DT$region` en su lugar. O `DT[["region"]]`.

source: Why does `DT[, region]` return a vector for the "region" column? I'd like a 1-column data.table.
es: ¿Por qué `DT[, region]` devuelve un vector para la columna "region"? Me gustaría tener una tabla de datos de una columna.

source: Try `DT[ , .(region)]` instead. `.()` is an alias for `list()` and ensures a data.table is returned.
es: Pruebe `DT[ , .(region)]` en su lugar. `.()` es un alias para `list()` y garantiza que se devuelva una tabla de datos.

source: Also continue reading and see the FAQ after next. Skim whole documents before getting stuck in one part.
es: Continúe leyendo y consulte las preguntas frecuentes a continuación. Lea todo el documento antes de quedarse atascado en una parte.

source: Why does `DT[ , x, y, z]` not work? I wanted the 3 columns `x`,`y` and `z`.
es: ¿Por qué no funciona `DT[, x, y, z]`? Quería las 3 columnas `x`,`y` y `z`.

source: The `j` expression is the 2nd argument. Try `DT[ , c("x","y","z")]` or `DT[ , .(x,y,z)]`.
es: La expresión `j` es el segundo argumento. Pruebe `DT[ , c("x","y","z")]` o `DT[ , .(x,y,z)]`.

source: I assigned a variable `mycol="x"` but then `DT[, mycol]` returns an error. How do I get it to look up the column name contained in the `mycol` variable?
es: Asigné una variable `mycol="x"` pero luego `DT[, mycol]` devuelve un error. ¿Cómo hago para que busque el nombre de la columna contenida en la variable `mycol`?

source: The error is that column named `"mycol"` cannot be found, and this error is correct. `data.table`'s scoping is different to `data.frame` in that you can use column names as if they are variables directly inside `DT[...]` without prefixing each column name with `DT$`; see FAQ 1.1 above.
es: El error es que no se puede encontrar la columna denominada `"mycol"`, y este error es correcto. El alcance de `data.table` es diferente a `data.frame` en que puede usar nombres de columnas como si fueran variables directamente dentro de `DT[...]` sin anteponer `DT$` a cada nombre de columna; consulte la pregunta frecuente 1.1 anterior.

source: To use `mycol` to select the column `x` from `DT`, there are a few options:
es: Para utilizar `mycol` para seleccionar la columna `x` de `DT`, hay algunas opciones:

source: See `?data.table` for more details about the `..` prefix.
es: Consulte `?data.table` para obtener más detalles sobre el prefijo `..`.

source: The `with` argument takes its name from the `base` function `with()`. When `with=TRUE` (default), `data.table` operates similar to `with()`, i.e. `DT[, mycol]` behaves like `with(DT, mycol)`. When `with=FALSE`, the standard `data.frame` evaluation rules apply to all variables in `j` and you can no longer use column names directly.
es: El argumento `with` toma su nombre de la función `base` `with()`. Cuando `with=TRUE` (predeterminado), `data.table` opera de manera similar a `with()`, es decir, `DT[, mycol]` se comporta como `with(DT, mycol)`. Cuando `with=FALSE`, las reglas de evaluación estándar de `data.frame` se aplican a todas las variables en `j` y ya no se pueden usar nombres de columnas directamente.

source: What are the benefits of being able to use column names as if they are variables inside `DT[...]`?
es: ¿Cuáles son los beneficios de poder usar nombres de columnas como si fueran variables dentro de `DT[...]`?

source: `j` doesn't have to be just column names. You can write any R _expression_ of column names directly in `j`, _e.g._, `DT[ , mean(x*y/z)]`. The same applies to `i`, _e.g._, `DT[x>1000, sum(y*z)]`.
es: `j` no tiene por qué ser simplemente nombres de columnas. Puede escribir cualquier _expresión_ R de nombres de columnas directamente en `j`, _p. ej._, `DT[ , mean(x*y/z)]`. Lo mismo se aplica a `i`, _p. ej._, `DT[x>1000, sum(y*z)]`.

source: This runs the `j` expression on the set of rows where the `i` expression is true. You don't even need to return data, _e.g._, `DT[x>1000, plot(y, z)]`. You can do `j` by group simply by adding `by = `; e.g., `DT[x>1000, sum(y*z), by = w]`. This runs `j` for each group in column `w` but just over the rows where `x>1000`. By placing the 3 parts of the query (i=where, j=select and by=group by) inside the square brackets, data.table sees this query as a whole before any part of it is evaluated. Thus it can optimize the combined query for performance. It can do this because the R language uniquely has lazy evaluation (Python and Julia do not). data.table sees the expressions inside `DT[...]` before they are evaluated and optimizes them before evaluation. For example, if data.table see that you're only using 2 columns out of 100, it won't bother to subset the 98 that aren't needed by your j expression.
es: Esto ejecuta la expresión `j` en el conjunto de filas donde la expresión `i` es verdadera. Ni siquiera necesita devolver datos, _p. ej._, `DT[x>1000, plot(y, z)]`. Puede hacer `j` por grupo simplemente agregando `by = `; p. ej., `DT[x>1000, sum(y*z), by = w]`. Esto ejecuta `j` para cada grupo en la columna `w` pero solo sobre las filas donde `x>1000`. Al colocar las 3 partes de la consulta (i=where, j=select y by=group by) dentro de los corchetes, data.table ve esta consulta como un todo antes de que se evalúe cualquier parte de ella. Por lo tanto, puede optimizar la consulta combinada para el rendimiento. Puede hacer esto porque el lenguaje R tiene una evaluación diferida única (Python y Julia no la tienen). data.table ve las expresiones dentro de `DT[...]` antes de que se evalúen y las optimiza antes de la evaluación. Por ejemplo, si data.table ve que solo está usando 2 columnas de 100, no se molestará en crear un subconjunto de las 98 que no son necesarias para su expresión j.

source: OK, I'm starting to see what data.table is about, but why didn't you just enhance `data.frame` in R? Why does it have to be a new package?
es: Vale, estoy empezando a entender de qué se trata data.table, pero ¿por qué no mejoraron `data.frame` en R? ¿Por qué tiene que ser un paquete nuevo?

source: As [highlighted above]{1}, `j` in `[.data.table` is fundamentally different from `j` in `[.data.frame`. Even if something as simple as `DF[ , 1]` was changed in base R to return a data.frame rather than a vector, that would break existing code in many 1000's of CRAN packages and user code. As soon as we took the step to create a new class that inherited from data.frame, we had the opportunity to change a few things and we did. We want data.table to be slightly different and to work this way for more complicated syntax to work. There are other differences, too (see [below]{2} ).
es: Como [se destacó arriba]{1}, `j` en `[.data.table` es fundamentalmente diferente de `j` en `[.data.frame`. Incluso si algo tan simple como `DF[ , 1]` se cambiara en R base para devolver un data.frame en lugar de un vector, eso rompería el código existente en muchos miles de paquetes CRAN y código de usuario. Tan pronto como dimos el paso para crear una nueva clase que heredara de data.frame, tuvimos la oportunidad de cambiar algunas cosas y lo hicimos. Queremos que data.table sea ligeramente diferente y funcione de esta manera para que funcione una sintaxis más complicada. También hay otras diferencias (ver [abajo]{2}).

source: Furthermore, data.table _inherits_ from `data.frame`. It _is_ a `data.frame`, too. A data.table can be passed to any package that only accepts `data.frame` and that package can use `[.data.frame` syntax on the data.table. See [this answer]{1} for how that is achieved.
es: Además, data.table _hereda_ de `data.frame`. También _es_ un `data.frame`. Se puede pasar un data.table a cualquier paquete que solo acepte `data.frame` y ese paquete puede usar la sintaxis `[.data.frame` en data.table. Consulta [esta respuesta]{1} para saber cómo se logra esto.

source: We _have_ proposed enhancements to R wherever possible, too. One of these was accepted as a new feature in R 2.12.0:
es: También hemos propuesto mejoras para R siempre que ha sido posible. Una de ellas se aceptó como nueva característica en R 2.12.0:

source: `unique()` and `match()` are now faster on character vectors where all elements are in the global CHARSXP cache and have unmarked encoding (ASCII). Thanks to Matt Dowle for suggesting improvements to the way the hash code is generated in unique.c.
es: `unique()` y `match()` ahora son más rápidos en vectores de caracteres donde todos los elementos están en la caché CHARSXP global y tienen codificación sin marcar (ASCII). Gracias a Matt Dowle por sugerir mejoras en la forma en que se genera el código hash en unique.c.

source: A second proposal was to use `memcpy` in duplicate.c, which is much faster than a for loop in C. This would improve the _way_ that R copies data internally (on some measures by 13 times). The thread on r-devel is [here]{1}.
es: Una segunda propuesta fue utilizar `memcpy` en duplicate.c, que es mucho más rápido que un bucle for en C. Esto mejoraría la _forma_ en que R copia datos internamente (en algunas mediciones, hasta 13 veces). El hilo sobre r-devel está [aquí]{1}.

source: A third more significant proposal that was accepted is that R now uses data.table's radix sort code as from R 3.3.0:
es: Una tercera propuesta más significativa que fue aceptada es que R ahora usa el código de ordenamiento por radix de data.table a partir de R 3.3.0:

source: The radix sort algorithm and implementation from data.table (forder) replaces the previous radix (counting) sort and adds a new method for order(). Contributed by Matt Dowle and Arun Srinivasan, the new algorithm supports logical, integer (even with large values), real, and character vectors. It outperforms all other methods, but there are some caveats (see ?sort).
es: El algoritmo de ordenación por base y la implementación de data.table (forder) reemplazan la ordenación por base (conteo) anterior y agregan un nuevo método para order(). Aportado por Matt Dowle y Arun Srinivasan, el nuevo algoritmo admite vectores lógicos, enteros (incluso con valores grandes), reales y de caracteres. Supera a todos los demás métodos, pero existen algunas salvedades (consulte ?sort).

source: This was big event for us and we celebrated until the cows came home. (Not really.)
es: Este fue un gran acontecimiento para nosotros y lo celebramos hasta el cansancio (en realidad, no).

source: Why are the defaults the way they are? Why does it work the way it does?
es: ¿Por qué los valores predeterminados son los que son? ¿Por qué funciona como lo hace?

source: The simple answer is because the main author originally designed it for his own use. He wanted it that way. He finds it a more natural, faster way to write code, which also executes more quickly.
es: La respuesta es sencilla: el autor principal lo diseñó originalmente para su propio uso. Así lo quiso. Le parece una forma más natural y rápida de escribir código, que también se ejecuta más rápidamente.

source: Isn't this already done by `with()` and `subset()` in `base`?
es: ¿Esto no está ya hecho por `with()` y `subset()` en `base`?

source: Some of the features discussed so far are, yes. The package builds upon base functionality. It does the same sorts of things but with less code required and executes many times faster if used correctly.
es: Algunas de las características que hemos comentado hasta ahora son: sí. El paquete se basa en la funcionalidad básica. Hace el mismo tipo de cosas, pero requiere menos código y se ejecuta mucho más rápido si se utiliza correctamente.

source: Why does `X[Y]` return all the columns from `Y` too? Shouldn't it return a subset of `X`?
es: ¿Por qué `X[Y]` devuelve también todas las columnas de `Y`? ¿No debería devolver un subconjunto de `X`?
