Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-reference-semantics.Rmd-*.po
Languages: es

source: =====* And `ans` contains the maximum speed corresponding to each month.=====
es: =====* Y `ans` contiene la velocidad máxima correspondiente a cada mes.=====

source: However we could improve this functionality further by *shallow* copying instead of *deep* copying. In fact, we would very much like to [provide this functionality for `v1.9.8`]{1}. We will touch up on this again in the *data.table design* vignette.
es: Sin embargo, podríamos mejorar aún más esta funcionalidad mediante una copia *superficial* en lugar de una copia *profunda*. De hecho, nos gustaría mucho [ofrecer esta funcionalidad para `v1.9.8`]{1}. Volveremos a abordar este tema en la viñeta *diseño de data.table*.

source: =====2. When we store the column names on to a variable, e.g., `DT_n = names(DT)`, and then *add/update/delete* column(s) *by reference*. It would also modify `DT_n`, unless we do `copy(names(DT))`.=====
es: =====2. Cuando almacenamos los nombres de las columnas en una variable, por ejemplo, `DT_n = names(DT)`, y luego *agregamos/actualizamos/eliminamos* columnas *por referencia*, también modificaría `DT_n`, a menos que hagamos `copy(names(DT))`.=====

source: Summary
es: Resumen

source: The `:=` operator
es: El operador `:=`

source: =====* It is used to *add/update/delete* columns by reference.=====
es: =====* Se utiliza para *agregar/actualizar/eliminar* columnas por referencia.=====

source: =====* We have also seen how to use `:=` along with `i` and `by` the same way as we have seen in the *Introduction to data.table* vignette. We can in the same way use `keyby`, chain operations together, and pass expressions to `by` as well all in the same way. The syntax is *consistent*.=====
es: =====* También hemos visto cómo utilizar `:=` junto con `i` y `by` de la misma forma que hemos visto en la viñeta *Introducción a data.table*. De la misma forma, podemos utilizar `keyby`, encadenar operaciones y pasar expresiones a `by` también de la misma forma. La sintaxis es *consistente*.=====

source: =====* We can use `:=` for its side effect or use `copy()` to not modify the original object while updating by reference.=====
es: =====* Podemos usar `:=` por su efecto secundario o usar `copy()` para no modificar el objeto original mientras actualizamos por referencia.=====

source: So far we have seen a whole lot in `j`, and how to combine it with `by` and little of `i`. Let's turn our attention back to `i` in the next vignette *"Keys and fast binary search based subset"* to perform *blazing fast subsets* by *keying data.tables*.
es: Hasta ahora hemos visto mucho sobre `j`, y cómo combinarlo con `by` y un poco de `i`. Volvamos nuestra atención a `i` en la siguiente viñeta *"Subconjunto basado en claves y búsqueda binaria rápida"* para realizar *subconjuntos ultrarrápidos* mediante *claves data.tables*.
