Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-importing.Rmd-*.po
Languages: es

source: When using a package as a suggested dependency, you should not `import` it in the `NAMESPACE` file. Just mention it in the `DESCRIPTION` file. When using `data.table` functions in package code (R/* files) you need to use the `data.table::` prefix because none of them are imported. When using `data.table` in package tests (e.g. tests/testthat/test* files), you need to declare `.datatable.aware=TRUE` in one of the R/* files.
es: Cuando se utiliza un paquete como dependencia sugerida, no se debe "importar" en el archivo "NAMESPACE". Solo hay que mencionarlo en el archivo "DESCRIPTION". Cuando se utilizan funciones "data.table" en el código del paquete (archivos R/*), se debe utilizar el prefijo "data.table::" porque ninguna de ellas se importa. Cuando se utiliza "data.table" en pruebas de paquetes (por ejemplo, archivos tests/testthat/test*), se debe declarar ".datatable.aware=TRUE" en uno de los archivos R/*.

source: `data.table` in `Imports` but nothing imported
es: `data.table` en `Importaciones` pero no se importó nada

source: Some users ([e.g.]{1}) may prefer to eschew using `importFrom` or `import` in their `NAMESPACE` file and instead use `data.table::` qualification on all internal code (of course keeping `data.table` under their `Imports:` in `DESCRIPTION`).
es: Algunos usuarios ([eg]{1}) pueden preferir evitar el uso de `importFrom` o `import` en su archivo `NAMESPACE` y en su lugar usar la calificación `data.table::` en todo el código interno (por supuesto, manteniendo `data.table` debajo de su `Imports:` en `DESCRIPTION`).

source: In this case, the un-exported function `[.data.table` will revert to calling `[.data.frame` as a safeguard since `data.table` has no way of knowing that the parent package is aware it's attempting to make calls against the syntax of `data.table`'s query API (which could lead to unexpected behavior as the structure of calls to `[.data.frame` and `[.data.table` fundamentally differ, e.g. the latter has many more arguments).
es: En este caso, la función no exportada `[.data.table` volverá a llamar a `[.data.frame` como medida de protección, ya que `[.data.table` no tiene forma de saber que el paquete principal es consciente de que está intentando realizar llamadas contra la sintaxis de la API de consulta de `[.data.table` (lo que podría generar un comportamiento inesperado ya que la estructura de las llamadas a `[.data.frame` y `[.data.table` difieren fundamentalmente, por ejemplo, este último tiene muchos más argumentos).

source: If this is anyway your preferred approach to package development, please define `.datatable.aware = TRUE` anywhere in your R source code (no need to export). This tells `data.table` that you as a package developer have designed your code to intentionally rely on `data.table` functionality even though it may not be obvious from inspecting your `NAMESPACE` file.
es: Si este es de todos modos su enfoque preferido para el desarrollo de paquetes, defina `.datatable.aware = TRUE` en cualquier parte de su código fuente R (sin necesidad de exportar). Esto le indica a `data.table` que usted, como desarrollador de paquetes, ha diseñado su código para que dependa intencionalmente de la funcionalidad de `data.table`, aunque puede que no sea obvio al inspeccionar su archivo `NAMESPACE`.

source: `data.table` determines on the fly whether the calling function is aware it's tapping into `data.table` with the internal `cedta` function (**C**alling **E**nvironment is **D**ata **T**able **A**ware), which, beyond checking the `?getNamespaceImports` for your package, also checks the existence of this variable (among other things).
es: `data.table` determina sobre la marcha si la función que llama es consciente de que está accediendo a `data.table` con la función interna `cedta` (**C**alling **E**nvironment is **D**ata **T**able **A**ware), que, además de verificar `?getNamespaceImports` para su paquete, también verifica la existencia de esta variable (entre otras cosas).

source: Further information on dependencies
es: Más información sobre dependencias

source: For more canonical documentation of defining packages dependency check the official manual: [Writing R Extensions]{1}.
es: Para obtener documentación más canónica sobre la definición de dependencias de paquetes, consulte el manual oficial: [Escritura de extensiones R]{1}.

source: Importing data.table C routines
es: Importación de rutinas data.table C

source: Some of internally used C routines are now exported on C level thus can be used in R packages directly from their C code. See [`?cdt`]{1} for details and [Writing R Extensions]{2} _Linking to native routines in other packages_ section for usage.
es: Algunas de las rutinas C utilizadas internamente ahora se exportan a nivel C, por lo que se pueden usar en paquetes R directamente desde su código C. Consulte [`?cdt`]{1} para obtener detalles y la sección [Escritura de extensiones R]{2} _Enlace a rutinas nativas en otros paquetes_ para su uso.

source: Importing from non-r Applications {#non-r-api}
es: Importación desde aplicaciones que no son R {#non-r-api}

source: Some tiny parts of `data.table` C code were isolated from the R C API and can now be used from non-R applications by linking to .so / .dll files. More concrete details about this will be provided later; for now you can study the C code that was isolated from the R C API in [src/fread.c]{1} and [src/fwrite.c]{2}.
es: Algunas pequeñas partes del código C de `data.table` se aislaron de la API de RC y ahora se pueden usar desde aplicaciones que no sean de R mediante la vinculación a archivos .so / .dll. Más adelante se brindarán detalles más concretos sobre esto; por ahora, puede estudiar el código C que se aisló de la API de RC en [src/fread.c]{1} y [src/fwrite.c]{2}.

source: How to convert your Depends dependency on data.table to Imports
es: Cómo convertir su dependencia Depends en data.table a Imports

source: To convert a `Depends` dependency on `data.table` to an `Imports` dependency in your package, follow these steps:
es: Para convertir una dependencia `Depends` de `data.table` en una dependencia `Imports` en su paquete, siga estos pasos:

source: Step 0. Ensure your package is passing R CMD check initially
es: Paso 0. Asegúrese de que su paquete pase la verificación R CMD inicialmente

source: Step 1. Update the DESCRIPTION file to put data.table in Imports, not Depends
es: Paso 1. Actualice el archivo DESCRIPCIÓN para colocar data.table en Importaciones, no en Dependencias

source: **Before:**
es: **Antes:**

source: **After:**
es: **Después:**

source: Step 2.1: Run `R CMD check`
es: Paso 2.1: Ejecutar `R CMD check`

source: Run `R CMD check` to identify any missing imports or symbols. This step helps:
es: Ejecute `R CMD check` para identificar las importaciones o los símbolos faltantes. Este paso ayuda a:

source: =====- Automatically detect any functions or symbols from `data.table` that are not explicitly imported.===== =====- Flag missing special symbols like `.N`, `.SD`, and `:=`.===== =====- Provide immediate feedback on what needs to be added to the NAMESPACE file.=====
es: =====- Detecta automáticamente cualquier función o símbolo de `data.table` que no se importe explícitamente.===== =====- Marca los símbolos especiales faltantes como `.N`, `.SD` y `:=`.===== =====- Proporciona comentarios inmediatos sobre lo que se debe agregar al archivo NAMESPACE.=====

source: Note: Not all such usages are caught by `R CMD check`. In particular, `R CMD check` skips some symbols/functions in formulas and will completely miss parsed expressions like `parse(text = "data.table(a = 1)")`. Packages will need good test coverage to detect these edge cases.
es: Nota: No todos estos usos son detectados por `R CMD check`. En particular, `R CMD check` omite algunos símbolos/funciones en fórmulas y no detecta expresiones analizadas como `parse(text = "data.table(a = 1)")`. Los paquetes necesitarán una buena cobertura de pruebas para detectar estos casos extremos.

source: Step 2.2: Modify the NAMESPACE file
es: Paso 2.2: Modificar el archivo NAMESPACE

source: Based on the `R CMD check` results, ensure all used functions, special symbols, S3 generics, and S4 classes from `data.table` are imported.
es: Según los resultados de `R CMD check`, asegúrese de que se importen todas las funciones utilizadas, los símbolos especiales, los genéricos S3 y las clases S4 de `data.table`.

source: That means adding `importFrom(data.table, ...)` directives for symbols, functions, and S3 generics, and/or `importClassesFrom(data.table, ...)` directives for S4 classes as appropriate. See 'Writing R Extensions' for full details on how to do so properly.
es: Esto significa agregar directivas `importFrom(data.table, ...)` para símbolos, funciones y genéricos de S3, y/o directivas `importClassesFrom(data.table, ...)` para clases de S4 según corresponda. Consulte "Cómo escribir extensiones de R" para obtener detalles completos sobre cómo hacerlo correctamente.

source: Blanket import
es: Importación de mantas

source: Alternatively, you can import all functions from `data.table` at once, though this is generally not recommended:
es: Como alternativa, puede importar todas las funciones de `data.table` a la vez, aunque esto generalmente no se recomienda:

source: **Justification for Avoiding Blanket Imports:** =====1. **Documentation**: The NAMESPACE file can serve as good documentation of how you depend on certain packages.===== =====2. **Avoiding Conflicts**: Blanket imports leave you open to subtle breakage. For example, if you `import(pkgA)` and `import(pkgB)`, but later pkgB exports a function also exported by pkgA, this will break your package due to conflicts in your namespace, which is disallowed by `R CMD check` and CRAN.=====
es: **Justificación para evitar importaciones generales:** =====1. **Documentación**: El archivo NAMESPACE puede servir como buena documentación de cómo depende de ciertos paquetes.===== =====2. **Evitar conflictos**: Las importaciones generales lo dejan expuesto a fallas sutiles. Por ejemplo, si `import(pkgA)` e `import(pkgB)`, pero luego pkgB exporta una función también exportada por pkgA, esto romperá su paquete debido a conflictos en su espacio de nombres, lo cual no está permitido por `R CMD check` y CRAN.=====

source: Step 3: Update Your R code files outside the package's R/ directory
es: Paso 3: Actualice los archivos de código R fuera del directorio R/ del paquete

source: When you move a package from `Depends` to `Imports`, it will no longer be automatically attached when your package is loaded. This can be important for examples, tests, vignettes, and demos, where `Imports` packages need to be attached explicitly.
es: Cuando mueves un paquete de `Depends` a `Imports`, ya no se adjuntará automáticamente cuando se cargue el paquete. Esto puede ser importante para ejemplos, pruebas, viñetas y demostraciones, donde los paquetes `Imports` deben adjuntarse explícitamente.

source: **Before (with `Depends`):**
es: **Antes (con `Depende`):**

source: **After (with `Imports`):**
es: **Después (con `Importaciones`):**

source: Benefits of using `Imports`
es: Beneficios de utilizar “Importaciones”

source: =====- **User-Friendliness**: `Depends` alters your users' `search()` path, possibly without their wanting to do so.===== =====- **Namespace Management**: Only the functions your package explicitly imports are available, reducing the risk of function name clashes.===== =====- **Cleaner Package Loading**: Your package's dependencies are not attached to the search path, making the loading process cleaner and potentially faster.===== =====- **Easier Maintenance**: It simplifies maintenance tasks as upstream dependencies' APIs evolve. Depending too much on `Depends` can lead to conflicts and compatibility issues over time.=====
es: =====- **Facilidad de uso**: `Depends` modifica la ruta `search()` de sus usuarios, posiblemente sin que ellos lo deseen.===== =====- **Gestión de espacios de nombres**: Solo las funciones que su paquete importa explícitamente están disponibles, lo que reduce el riesgo de conflictos de nombres de funciones.===== =====- **Carga de paquetes más limpia**: Las dependencias de su paquete no se adjuntan a la ruta de búsqueda, lo que hace que el proceso de carga sea más limpio y potencialmente más rápido.===== =====- **Mantenimiento más sencillo**: Simplifica las tareas de mantenimiento a medida que evolucionan las API de las dependencias ascendentes. Depender demasiado de `Depends` puede provocar conflictos y problemas de compatibilidad con el tiempo.=====
