Repository: cienciadedatos/traduccion-vignettes-datatable
Catalog: vignettes/*/po/datatable-programming.Rmd-*.po
Languages: es

source: Instead of using `eval` function we can provide quoted expression into the element of `env` argument, no extra `eval` call is needed then.
es: En lugar de utilizar la función `eval`, podemos proporcionar una expresión entre comillas en el elemento del argumento `env`, por lo que no se necesita una llamada `eval` adicional.
